<a href="https://colab.research.google.com/github/paramik123/Python-programs/blob/main/Leetcode_SQL_Top50.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Leetcode SQL Top 50 problems**

1. Recyclable and Low Fat Products

In [ ]:
select product_id from Products where low_fats='Y' and recyclable ='Y';

2.  Find Customer Referee

In [ ]:
SELECT name
FROM customer
WHERE referee_id IS NULL OR referee_id != 2;

3. Big Countries

In [ ]:
select name, population, area from World where area >=3000000 or population >= 25000000;

4. Article Views I

In [ ]:
select distinct author_id as id from Views where author_id = viewer_id order by id;

5. Invalid Tweets

In [ ]:
select tweet_id from Tweets where length(content) >15;

6. Replace Employee ID With The Unique Identifier

In [ ]:
SELECT Employees.name, EmployeeUNI.unique_id
FROM Employees
LEFT JOIN EmployeeUNI ON Employees.id=EmployeeUNI.id;

7. Product Sales Analysis I

In [ ]:
select Product.product_name, Sales.year, Sales.price from Sales JOIN Product ON Sales.product_id = Product.product_id;

8. Customer Who Visited but Did Not Make Any Transactions

In [ ]:
select v.customer_id,count(v.visit_id) as count_no_trans from Visits v left join Transactions t On v.visit_id=t.visit_id where transaction_id IS NULL group by v.customer_id;

9. Rising Temperature

In [ ]:
select a.id from Weather a, Weather b where a.temperature>b.temperature and datediff(a.recorddate,b.recorddate)=1

10. Employee Bonus

In [ ]:
select a.name, b.bonus from Employee a left join bonus b on a.empId=b.empId where b.bonus is NULL or b.bonus<1000 ;

11. Managers with at Least 5 Direct Reports

In [ ]:
select name from Employee where id IN(
select managerId from Employee group by managerId having count(id)>=5);

12. Not Boring Movies

In [ ]:
select id,movie, description, rating from Cinema where id%2=1 and description != "boring" order by rating desc;

13. Number of Unique Subjects Taught by Each Teacher

In [ ]:
select teacher_id, count(distinct subject_id) as cnt from Teacher group by teacher_id;

14. Classes More Than 5 Students

In [ ]:
select class from Courses group by class having count(student)>=5;

15. Find Followers Count

In [ ]:
select user_id, count(distinct follower_id) as followers_count from Followers group by user_id;

16. Biggest Single Number

In [ ]:
select max(num) as num from (select num from MyNumbers group by num having count(num)=1) new;

17. Fix Names in a Table

In [ ]:
SELECT user_id, CONCAT(UPPER(SUBSTR(name, 1, 1)), LOWER(SUBSTR(name, 2))) AS name
FROM users
ORDER BY user_id;

18. Patients With a Condition

In [ ]:
SELECT *FROM Patients
WHERE conditions LIKE '% DIAB1%' OR conditions LIKE 'DIAB1%'

19. Delete Duplicate Emails

In [ ]:
delete p1 from Person p1,Person p2 where p1.Email = p2.Email And p1.Id > p2.Id

20. Second Highest Salary

In [ ]:
select max(salary) as SecondHighestSalary from Employee where salary != (select max(salary) from Employee)

21. Group Sold Products By The Date

In [ ]:
SELECT
  sell_date,
  COUNT(DISTINCT(product)) AS num_sold,
  GROUP_CONCAT(DISTINCT(product)) AS products
FROM Activities
GROUP BY sell_date

22. Find Users With Valid E-Mails

In [ ]:
select user_id, name, mail from Users where mail regexp '^[a-zA-Z][a-zA-Z0-9_.-]*@leetcode[.]com';

23. Customers Who Bought All Products

In [ ]:
SELECT cusotmer_id from Customer GROUP BY customer_id HAVING count(distinct product_key) = (SELECT COUNT(product_key) from Product);

24. Triangle judgement

In [ ]:
select x,y,z,
CASE WHEN x+y<=z THEN "No"
WHEN y+z<=x THEN "No"
WHEN x+z<=y THEN "No"
else
"Yes" end as triangle from Triangle;

25. Last person to fit in the bus

In [ ]:
with cte as (
  select person_id, person_name, weight, turn, sum(weight) over (order by turn) as cum_weight
  from Queue order by turn
)

select person_name from Queue where turn= (select max(turn) from cte where cum_weight <=1000);

26. Consecutive numbers

In [ ]:
WITH cte AS
(SELECT *, LEAD (num,1) OVER() AS next_1, LEAD (num,2) OVER() AS next_2 FROM logs)

SELECT DISTINCT num AS ConsecutiveNums
FROM cte where num=next_1 AND num=next_2;

27. The Number of Employees Which Report to Each Employee

In [ ]:
WITH cte AS
(SELECT reports_to, COUNT(employee_id) AS reports_count,
ROUND(avg(age),0) AS average_age FROM Employees where reports_to IS NOT NULL GROUP BY reports_to)

select c.reports_to AS employee_id, e.name, c.reports_count, c.average_age
FROM cte c
LEFT JOIN Employees e
ON c.reports_to=e.employee_id order by employee_id;

28. Count Salary Categories

In [ ]:
# Write your MySQL query statement below
select "Low Salary" as category, sum(CASE WHEN INCOME <20000 THEN 1 ELSE 0 END) AS accounts_count from Accounts
UNION

select "Average Salary" as category, sum(CASE WHEN INCOME BETWEEN 20000 AND 50000 THEN 1 ELSE 0 END) AS accounts_count from Accounts
UNION
select "High Salary" as category, sum(CASE WHEN INCOME >50000 THEN 1 ELSE 0 END) AS accounts_count from Accounts;